# BEGINNER TUTORIAL

Welcome to the first part of the SQL tutorial! We are happy to see you here. In this notebook, you will learn the basic syntax of a SQL query, and begin to navigate a database to get the information you need. Once you've finished, you will be able to specify what kind of data you want from any database you have on hand. As with all unknown things, this is going to be an adventure - but no worries, since you already worked up the courage to be here, you'll be just fine :)

## Using this notebook
In a Jupyter notebook, code belongs in the gray cells and are executed cell by cell. Some of the cells in this notebook are already filled out with example code to help you understand the concepts, and some are left empty for you to fill. To execute the code in a particular cell, press **shift + enter** with your cursor in the cell you wish to execute. 

To make sure you got it, try it for yourself! The first thing we need to do is connect this notebook to our database. Below are two cells containing code to do so. Place your cursor in the appropriate cell and press **shift + enter** to execute it. If all went well, you'll see a number appear in the brackets next to the cell, but nothing else; otherwise, find a coach and we'll try to figure out what went wrong.

### Mac

In [ ]:
-- connection: postgresql://localhost:5432/northwind

### Windows

In [ ]:
-- connection: host='localhost' dbname='northwind' user='postgres' password='postgres'

For our exercises, we will be using the Northwind Database. This database is about a company named "Northwind Traders" and captures all the sales transactions that occur between the company and the customers, as well as the purchase transactions between Northwind and its suppliers.

The diagram shows the table structure of the Northwind database.

![](img/northwind_schema.png)

There are additional tables, but we will only be using the ones shown above in this tutorial.

Most of the actions you need to perform on a database are down with SQL statements. The general syntax of a SQL query takes the form below:

```
SELECT DISTINCT < column expression list >
FROM < relation >
WHERE < predicate >
GROUP BY < column list > 
HAVING < predicate > 
ORDER BY < column list > 
LIMIT < number > ;
```

SQL keywords are NOT case sensitive; select is the same as SELECT. However, it is common practice to write SQL syntax in capital letters. It also helps to visually structure your query for others to read. We will write all SQL keywords in uppercase.

A semicolon is the standard way to separate each SQL statement in database systems that allow more than one SQL statement to be executed in the same call to the server. In this tutorial, we will use semicolon at the end of each SQL statement.

### Select Statements

The SELECT statement is used to select data from a database. The data returned is stored in a result table, called the result-set.

Try out the following SQL statements to see what columns you select from the "Customers" table.

In [ ]:
SELECT CompanyName, Address FROM Customers;

In [ ]:
SELECT * FROM Customers;

Inside a table, a column often contains many duplicate values; and sometimes you only want to list the different (distinct) values. The SELECT DISTINCT statement is used to return only unique values.

What is the difference between the two statements below?

In [ ]:
SELECT Country FROM Customers;

In [ ]:
SELECT DISTINCT Country FROM Customers;

### Where Clause

The WHERE clause is used to filter records.

The WHERE clause is used to extract only those records that fulfill a specified condition.

In [ ]:
SELECT * FROM Customers 
WHERE Country = 'Mexico';

The following operators can be used in the WHERE clause:

Operator | Description |
--- |---|
= | Equal |
<> | Not equal|
\> | Greater than |
< | Less than|
\>= |Greater than or equal|
<= |Less than or equal|
BETWEEN |Between an inclusive range|
LIKE |Search for a pattern|
IN |To specify multiple possible values for a column|


### And/Not/Or Operators
The WHERE clause can be combined with AND, OR, and NOT operators.

The AND and OR operators are used to filter records based on more than one condition:

The AND operator displays a record if all the conditions separated by AND is TRUE.
The OR operator displays a record if any of the conditions separated by OR is TRUE.
The NOT operator displays a record if the condition(s) is NOT TRUE.

In [ ]:
SELECT * FROM Customers
WHERE Postalcode BETWEEN '05021' AND '05030';

In [ ]:
SELECT companyname, contactname, country
FROM Customers
WHERE NOT country = 'Mexico';

### Order By Keyword

The ORDER BY keyword is used to sort the result-set in ascending or descending order. You will need to order by one of the attribute names.

The ORDER BY keyword sorts the records in ascending order by default. To sort the records in descending order, use the DESC keyword.

In [ ]:
SELECT DISTINCT * FROM Customers
ORDER BY Country ASC;

In [ ]:
SELECT * FROM Customers
ORDER BY City ASC, Country DESC;

### Your turn to try! 

Select the company name, contact title, address, and region from the Customers table where the country isn't Italy.

Select all distinct columns from the Customers table where the country is France in ascending order by city.

Select the birthdate, address, city, and home phone from the Employees table where the city is in Seattle and the region is in Washington, ordered by postal code in descending order.

**(Hint: refer to the database schema at the top of the notebook)**

### Aggregate Functions

So far, we've only worked with data from the existing rows in the table - all of our returned tables have been some subset of the entries found in the table. But to conduct data analysis, we'll want to compute aggregate values over our data. In SQL, these are called aggregate functions.

|Common Aggregate Functions include **count, sum, average (avg), maximum (max), and minimum (min).**

For example, if we want to find the average price of all units in the Order Details table:

In [ ]:
SELECT AVG(UnitPrice) 
FROM Order_Details;

### Limit Clause

LIMIT helps us control how the data is displayed by limiting the number of rows shown.
If we want the top 3 distinct Customer IDs and ship names from the Orders table, then we would write:

In [ ]:
SELECT DISTINCT CustomerID, shipname 
FROM Orders
ORDER BY CustomerID
LIMIT 3;

We don't have to put ASC in the ORDER BY clause since SQL automatically orders in ascending order.  
Also note that LIMIT needs to be the last part of the query.

### Let's try it!

What is the first name, last name, and address of the first 10 employees in alphabetical order by last name? Use the Employees table.

How many employees are from London?

### Like Operator and Wildcard Character

The LIKE operator is used in a WHERE clause to search for a specified pattern in a column. To do so, we need a wildcard character. This is used to substitute any other character(s) in a string. 

There are two wildcards used in conjunction with the LIKE operator:

% - The percent sign represents zero, one, or multiple characters
_ - The underscore represents a single character

The percent sign and the underscore can also be used in combinations!
So, if we want to find details about the Sir Rodney products then we just need to type:

In [ ]:
SELECT * 
FROM Products
WHERE productname LIKE '%Sir Rodney%';

Or if we want to know which products start with 'S', then we need:

In [ ]:
SELECT * 
FROM Products
WHERE productname LIKE 'S%';

Or maybe we want to know which products start with 'L' and are at least 3 characters in length?

In [ ]:
SELECT * 
FROM Products
WHERE productname LIKE 'L_%_%';

Here are some other examples of how wildcard characters are used. 


LIKE Operator | Description |
--- |---|
WHERE productname LIKE 'a%' |Finds any values that starts with "a" |
WHERE productname LIKE '%a' |Finds any values that ends with "a"|
WHERE productname LIKE '%or%' |Finds any values that have "or" in any position |
WHERE productname LIKE '_r%' |Finds any values that have "r" in the second position |
WHERE productname LIKE 'a_%_%' |Finds any values that starts with "a" and are at least 3 characters in length |
WHERE productname LIKE 'a%o' |Finds any values that starts with "a" and ends with "o" |

### In Operator

The IN operator allows you to specify multiple values in a WHERE clause.
**This serves as a shorthand for multiple OR conditions.**

The following statement selects all company names in Sweden, Germany, and France.

In [ ]:
SELECT companyname 
FROM Customers
WHERE country IN ('Sweden', 'Germany', 'France');

### Between Operator

The BETWEEN operator selects values within a given range. The values can be numbers, text, or dates. This operator is inclusive: begin and end values are included.


The following statement selects the average unit price between 10 and 30 from the Order Details table.

In [ ]:
SELECT AVG(unitprice)
FROM Order_Details
WHERE unitprice BETWEEN 10 AND 30;

We can also negate this by adding the NOT clause to show the minimum unit price outside the previous example range.

In [ ]:
SELECT MIN(unitprice)
FROM Order_Details
WHERE unitprice NOT BETWEEN 10 and 30;

### Let's practice!

What is the count of the freights from the Orders table where the order id is between 10250 and 10400?

What is the supplierid, categoryid, and product name from the Products table where the productname starts with Qu and has at least 4 letters?

What are the units in stock from the Products table where the category id is between 5 and 7 in descending order? Only list in the top 3.

### GROUP BY Statement

The GROUP BY statement is often used with aggregate functions *(COUNT, MAX, MIN, SUM, AVG)* to group the result by one or more columns. 

The following SQL statement lists the number of customers in each country:

In [ ]:
SELECT COUNT(CustomerID), Country
FROM Customers
GROUP BY Country;

The following SQL statement lists the number of customers in each country, sorted high to low:

In [ ]:
SELECT COUNT(CustomerID), Country
FROM Customers
GROUP BY Country
ORDER BY COUNT(CustomerID) DESC;

### The SQL HAVING Clause

The HAVING clause was added to SQL because the WHERE keyword could not be used with aggregate functions. It must follow the `Group By` clause to be used. The syntax is structured like:

```
SELECT column_name(s)
FROM table_name
WHERE condition
GROUP BY column_name(s)
HAVING condition
ORDER BY column_name(s);
```

The following SQL statement lists the number of customers in each country. We've only included countries with more than 5 customers:

In [ ]:
SELECT COUNT(CustomerID), Country
FROM Customers
GROUP BY Country
HAVING COUNT(CustomerID) > 5;

### Aliasing

Sometimes column names are obscure and long, so we don't always want to type out all of it in our query. This is where aliases come in.

SQL aliases are used to give a table (or a column in a table) a temporary name and are often used to make column names more readable, but only exists for the duration of the query.

The following statement aliases the shipregion and shipaddress for the query.

In [ ]:
SELECT shipregion AS Region, shipaddress AS Address
FROM Orders
LIMIT 3;

You can also alias the name of the table. This can be used when referencing multiple tables and in WHERE statements. We will go more into this later. Here's an example of aliasing a table for now:

In [ ]:
SELECT *
FROM Order_Details AS Details
WHERE Details.productid = 11
LIMIT 2;

### Congrats!
You have reached the end of the beginner half of this tutorial! 

We have introduced SQL syntax and the most important SQL statements needed to conduct data analysis using a relational database management system. You should now know how to select what kind of data you need from a single table in your database. 

If you have finished early, here are some extra practice problems to work through. At 12, we will break for lunch and start the intermediate portion of this workshop.

### Extra Practice

What are the top 3 unit prices from the Products table where the supplier id is not between 2 and 6 and discontinued is 1?

Select the top 5 contact titles, contact names, and company names from the Suppliers table where the country is in USA, Singapore, Finland, ordered by city alphabetically. Alias the contact title as 'title', the contact name as 'name', and the company name as 'company'.

What is the contact name, contact title and address of the customers who are in any sales positions and from Brazil, France, or Germany? Alias the contact name as 'name' and the contact title as 'title'.

What is the max units in stock from the products table where the unit price is between 30 and 60 and the product name does not contain tofu?

What are the top 3 order ids, required date, shipped date, and shipname from the Orders table where the ship country is in Switzerland, in descending order?

What is the count of unit prices from the Products table for each Category ID? List the category IDs in ascending order.

What is the Customer ID from the Orders table that have Order IDs between `10250` and `10477` and have an average freight larger than 22?